10/data/attachments/2a9947bc46ee6cfc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Kenneth_debate_Friend_66964_1</nif:username>
            <nif:friendToBeRequested>soap_friends_3366b451-5789-4053-9ce3-aaa5786d2676</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>